In [1]:
import pandas as pd

# 创建DataFrame对象

In [2]:
data = [[109, 107, 100],
        [105, 114, 135],
        [98, 88, 120],
        [145, 150, 130]]
name = ['刘备', '关羽', '张飞', '诸葛亮']
columns = ['语文', '数学', '英语']
df = pd.DataFrame(
    data=data,
    index=name,
    columns=columns)
df

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

# 使用loc方法抽取

In [3]:
df.loc['张飞']

语文     98
数学     88
英语    120
Name: 张飞, dtype: int64

In [6]:
df.loc[['张飞', '关羽']]

     语文   数学   英语
张飞   98   88  120
关羽  105  114  135

# 使用iloc方法抽取

In [5]:
df.iloc[2]

语文     98
数学     88
英语    120
Name: 张飞, dtype: int64

In [7]:
df.iloc[[1, 2]]

     语文   数学   英语
关羽  105  114  135
张飞   98   88  120

# 抽取指定行的数据
- 使用loc和iloc

In [8]:
df

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

## 从“刘备”到“诸葛亮”

In [9]:
df.loc['刘备':'诸葛亮']

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

## 第1行到“关羽”

In [10]:
df.loc[:'关羽']

     语文   数学   英语
刘备  109  107  100
关羽  105  114  135

## 第1行到第4行

In [13]:
df.iloc[0:4]

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

## 第2行到最后1行

In [14]:
df.iloc[1:]

      语文   数学   英语
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

# 抽取指定列的数据

## 直接使用列名

In [19]:
df[['语文']]

      语文
刘备   109
关羽   105
张飞    98
诸葛亮  145

## 使用loc和iloc

### 抽取“语文”和“数学”

In [20]:
df[['语文', '数学']]

      语文   数学
刘备   109  107
关羽   105  114
张飞    98   88
诸葛亮  145  150

### 抽取第1列和第2列

In [21]:
df.iloc[:, [0, 1]]

      语文   数学
刘备   109  107
关羽   105  114
张飞    98   88
诸葛亮  145  150

### 抽取从“语文”开始到最后1列

In [22]:
df.loc[:, '语文':]

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

### 抽取从第1列开始到第3列

In [26]:
df.iloc[:, :2]

      语文   数学
刘备   109  107
关羽   105  114
张飞    98   88
诸葛亮  145  150

# 抽取指定行列的数据
- 使用loc和iloc

## “英语”成绩

In [28]:
df.loc[:, '英语']

刘备     100
关羽     135
张飞     120
诸葛亮    130
Name: 英语, dtype: int64

## “关羽”的“英语”成绩

In [30]:
df.loc[['关羽'], ['英语']]

     英语
关羽  135

## “关羽”的“数学”和“英语”成绩

In [31]:
df.loc[['关羽'], ['数学', '英语']]

     数学   英语
关羽  114  135

## 第2行第3列

In [33]:
df.iloc[[1], [2]]

     英语
关羽  135

## 第2行到最后1行，第3列

In [35]:
df.iloc[1:, [2]]

      英语
关羽   135
张飞   120
诸葛亮  130

## 第2行到最后1行，第1列和第3列

In [36]:
df.iloc[1:, [0, 2]]

      语文   英语
关羽   105  135
张飞    98  120
诸葛亮  145  130

## 所有行，第3列

In [38]:
df.iloc[:, [2]]

      英语
刘备   100
关羽   135
张飞   120
诸葛亮  130

# 按指定条件抽取数据

## 语文大于105且数学大于88

In [41]:
df.loc[(df['语文'] > 105) & (df['数学'] > 88)]

      语文   数学   英语
刘备   109  107  100
诸葛亮  145  150  130

## 语文大于105或数学大于88

In [42]:
df.loc[(df['语文'] > 105) | (df['数学'] > 88)]
# enter

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
诸葛亮  145  150  130

In [46]:
a = df['语文'] > 105
b = df['数学'] > 88
df.loc[a | b]
# enter

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
诸葛亮  145  150  130

## 语文不等于105
- !=

In [43]:
df.loc[df['语文'] != 105]

      语文   数学   英语
刘备   109  107  100
张飞    98   88  120
诸葛亮  145  150  130

## 语文不等于105
- ~

In [45]:
df.loc[~(df['语文'] == 105)]

      语文   数学   英语
刘备   109  107  100
张飞    98   88  120
诸葛亮  145  150  130